Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: D Delete the file or directory under the cursor; a confirmation request will be issued.
es_es: D Borrar el archivo o directorio bajo el cursor; un dialogo le pedirá confirmación.

source: mb gb Make bookmark/goto bookmark
es_es: mb gb Crear marcador/ir a bookmark

source: The ":cd" command changes the current directory.
es_es: La orden «:cd» le permite cambiar a otro directorio.

source: You can see what the current directory is with the ":pwd" command: >
es_es: Puede ver cual es el directorio actual con la orden «:pwd»: >

source: Vim remembers the last directory that you used.
es_es: Vim recuerda el último directorio que usó.

source: Use "cd -" to go back to it.
es_es: Use «cd -» para volver a él.

source: When you split a window, both windows use the same current directory.
es_es: Cuando divide una ventana, ambas ventanas usan el mismo directorio actual.

source: When you want to edit a number of files somewhere else in the new window, you can make it use a different directory, without changing the current directory in the other window.
es_es: Cuando desea editar un nombre de archivos en otra ubicación en la ventana nueva, puede usar un directorio diferente, sin cambiar el directorio actual en la otra ventana.

source: This is called a local directory.
es_es: A esto se le llama el directorio local.

source: So long as no ":lcd" command has been used, all windows share the same current directory.
es_es: Mientras no use ninguna orden «:lcd», todas las ventanas comparten el directorio actual.

source: Doing a ":cd" command in one window will also change the current directory of the other window.
es_es: Ejecutar una orden «:cd» en una ventana cambiará también el directorio de la otra ventana.

source: For a window where ":lcd" has been used a different current directory is remembered.
es_es: Si se usa con «:lcd» con una ventana, se recordará otro directorio actual.

source: Using ":cd" or ":lcd" in other windows will not change it.
es_es: Usar «:cd» o «:lcd» en otras ventanas no modificará esta.

source: When using a ":cd" command in a window that uses a different current directory, it will go back to using the shared directory.
es_es: Cuando use la orden «:cd» en una ventana que usa un directorio actual diferente, esta volverá al directorio compartido.

source: You want to see what is in that "inits.h" file.
es_es: Desea ver el contenido del archivo «inits.h».

source: Move the cursor on the name of the file and type: >
es_es: Desplace el cursor al nombre del archivo y teclee: >

source: Vim will find the file and edit it.
es_es: Vim encontrará el archivo y lo editará.

source: What if the file is not in the current directory?
es_es: ¿Y en el caso de que el archivo no está en el directorio actual?

source: Vim will use the 'path' option to find the file.
es_es: Vim usará la opción 'path' (ruta) para encontrar el archivo.

source: This option is a list of directory names where to look for your file.
es_es: Esta opción es una lista de nombres de directorio donde buscar su archivo.

source: Suppose you have your include files located in "c:/prog/include".
es_es: Suponga que tiene sus archivos include en «c:/prog/include».

source: This command will add it to the 'path' option: >
es_es: Esta orden la añadiría a la opción 'path': >

source: This directory is an absolute path.
es_es: Este directorio es una ruta absoluta.

source: No matter where you are, it will be the same place.
es_es: No importa donde esté, tendrá la misma ubicación.

source: What if you have located files in a subdirectory, below where the file is?
es_es: ¿Y en el caso de que tiene archivos ubicados en un subdirectorio, debajo de donde está el archivo?

source: Then you can specify a relative path name.
es_es: Puede especificar en este caso un nombre de ruta relativo.

source: This starts with a dot: > :set path+=./proto
es_es: Esto empieza con un punto: > :set path+=./proto

source: This tells Vim to look in the directory "proto", below the directory where the file in which you use "gf" is.
es_es: Esto hace que Vim mire en el directorio «proto», debajo del directorio en el que está el archivo sobre el que usa «gf».

source: Thus using "gf" on "inits.h" will make Vim look for "proto/inits.h", starting in the directory of the file.
es_es: Por ello, usar «gf» con «inits.h» hace que Vim busque «proto/inits.h», empezando por el directorio del archivo.

source: Without the "./", thus "proto", Vim would look in the "proto" directory below the current directory.
es_es: Sin el «./», en este caso «proto», Vim buscará en el directorio «proto» por debajo del directorio actual.

source: And the current directory might not be where the file that you are editing is located.
es_es: Y puede que el directorio actual no sea en el que se ubica el archivo que está editando.

source: The 'path' option allows specifying the directories where to search for files in many more ways.
es_es: La opción 'path' permite especificar de muchas más maneras los directorios donde buscar los archivos.

source: See the help on the 'path' option.
es_es: Véase la ayuda de la opción 'path'.

source: The 'isfname' option is used to decide which characters are included in the file name, and which ones are not (e.g., the " character in the example above).
es_es: La opción 'isfname' se usa para decidir qué caracteres están incluidos en el nombre del archivo, y cuales no lo están (p. ej., el carácter «"» en el ejemplo anterior).

source: Vim will then use the 'path' option to try and locate the file.
es_es: Vim usará entonces la opción 'path' para buscar y ubicar el archivo.

source: This is the same as the ":edit" command, except for the use of 'path'.
es_es: Esto equivale a la orden «:edit», excepto por el uso de 'path'.

source: This finds the file "stdio.h" in your value of 'path'.
es_es: Esto encuentra el archivo «stdio.h» en su valor de 'path'.

source: The quotes are necessary to have one argument |-+c|.
es_es: Las comillas son necesarias para tener un argumento |-+c|.

source: The Vim editor uses the term buffer to describe a file being edited.
es_es: El editor Vim usa el término búfer para describir un archivo en edición.

source: Actually, a buffer is a copy of the file that you edit.
es_es: En realidad, un búfer es una copia del archivo que edita.

source: When you finish changing the buffer, you write the contents of the buffer to the file.
es_es: Cuando termina de modificar el búfer, escribe los contenidos del búfer en el archivo.

source: Buffers not only contain file contents, but also all the marks, settings, and other stuff that goes with it.
es_es: Los búfers no solo contienen los contenidos de al archivo, sino también las marcas, configuraciones y otros elementos que lo acompañan.

source: The buffer "one.txt" disappears from the screen, but Vim still knows that you are editing this buffer, so it keeps the modified text.
es_es: El búfer «uno.txt» desaparece de la pantalla, pero Vim sabe aún sabe que esté editando el búfer, así que guarda el texto modificado.

source: This is called a hidden buffer: The buffer contains text, but you can't see it.
es_es: A esto se le llama un búfer oculto: El búfer contiene texto, pero no puede verlo.

source: The argument of ":hide" is another command.
es_es: El argumento de «:hide» es otra orden.

source: ":hide" makes that command behave as if the 'hidden' option was set.
es_es: «:hide» hace que una orden se comporte como si la opción 'hidden' estuviese activada.

source: You could also set this option yourself.
es_es: También podría configurar usted mismo esta opción.

source: The effect is that when any buffer is abandoned, it becomes hidden.
es_es: El efecto que esto tiene es que cuando cualquier búfer, éste se ocultará.

source: Be careful!
es_es: ¡Cuidado!

source: When you have hidden buffers with changes, don't exit Vim without making sure you have saved all the buffers.
es_es: Cuando tenga búfers ocultos con cambios, no cierre Vim antes de asegurarse de haber guardado todos los búfers.

source: When a buffer has been used once, Vim remembers some information about it.
es_es: Si un búfer se ha usado una vez, Vim recordará alguna información del búfer.

source: When it is not displayed in a window and it is not hidden, it is still in the buffer list.
es_es: Cuando no está activa en una ventana y no oculta, aún se encontrará en la lista de búfers.

source: This is called an inactive buffer.
es_es: A esto se le llama un búfer inactivo.

source: Overview:
es_es: Vista general:

source: Active Appears in a window, text loaded.
es_es: Activo Aparece en una ventana, texto cargado.

source: Hidden Not in a window, text loaded.
es_es: Hidden No aparece en una ventana, texto cargado.

source: Inactive Not in a window, no text loaded.
es_es: Inactive No aparece en una ventana, texto no cargado.

source: The first column contains the buffer number.
es_es: La primera columna contiene el número de búfer.

source: You can use this to edit the buffer without having to type the name, see below.
es_es: Puede usar esto para editar el búfer sin tener que introducir el nombre, explicado a continuación.

source: After the buffer number come the flags.
es_es: Después del número aparecen las opciones.

source: Then the name of the file and the line number where the cursor was the last time.
es_es: Por último, el nombre del archivo y el número de línea en el que estaba el cursor al última vez.

source: The flags that can appear are these (from left to right):
es_es: Se permiten las siguientes opciones (de izquierda a derecha):

source: u Buffer is unlisted |unlisted-buffer|.
es_es: u Buffer no está listado |unlisted-buffer|.

source: % Current buffer.
es_es: % Búfer actual.

source: # Alternate buffer.
es_es: # Búfer alternativo.

source: a Buffer is loaded and displayed.
es_es: a El búfer está cargado y visible.

source: h Buffer is loaded but hidden.
es_es: h El búfer está cargado pero oculto.

source: = Buffer is read-only.
es_es: = El búfer es de sólo lectura.

source: - Buffer is not modifiable, the 'modifiable' option is off.
es_es: - El búfer no es modificable, la opción 'modifiable' está desactivada.

source: + Buffer has been modified.
es_es: + El búfer se ha modificado.

source: You can edit a buffer by its number.
es_es: Puede editar un búfer por su número.

source: That avoids having to type the file name: >
es_es: Esto evita tener que introducir el nombre del archivo: >

source: But the only way to know the number is by looking in the buffer list.
es_es: Pero la única manera de saber el número es a través de la lista de de búfers.

source: You can use the name, or part of it, instead: >
es_es: En lugar de esto, puede usar el nombre, o parte de él: >

source: Vim will find the best match for the name you type.
es_es: Vim mostrará la coincidencia más cercana al nombre que introduzca.

source: If there is only one buffer that matches the name, it will be used.
es_es: De sólo haber un búfer que coincida con el nombre, este se usará.

source: In this case "help.txt".
es_es: En este caso, «help.txt».

source: To open a buffer in a new window: >
es_es: Use lo siguiente para abrir un búfer en una nueva ventana: >

source: Again, this also works with a name.
es_es: Una vez más, esto también funciona con un nombre.

source: If you delete a buffer that was active (visible in a window), that window will be closed.
es_es: Si elimina un búfer que estaba activo (visible en una ventana), esa ventana se cerrará.

source: If you delete the current buffer, the current window will be closed.
es_es: Si elimina el búfer actual, se cerrará la ventana actual.

source: If it was the last window, Vim will find another buffer to edit.
es_es: Si era la última ventana, Vim encontrará otro búfer que editar.

source: You can't be editing nothing!
es_es: ¡No puede editar la nada!

source: Note: Even after removing the buffer with ":bdelete" Vim still remembers it.
es_es: Nota: Aún después de eliminar un búfer con «:bdelete», Vim aún lo recuerda.

source: It's actually made "unlisted", it no longer appears in the list from ":buffers".
es_es: En realidad, pasa a no «unlisted» (no listado), ya que no aparece en la lista de «:buffers».

source: The ":buffers!" command will list unlisted buffers (yes, Vim can do the impossible).
es_es: La orden «:buffers!» muestra los búfers no listados (sí, Vim es capaz de lo imposible).

source: To really make Vim forget about a buffer, use ":bwipe".
es_es: Para hacer que Vim olvide completamente un búfer, use «:bwipe».

source: Also see the 'buflisted' option.
es_es: Véase también la opción 'buflisted'.

source: *usr_90.txt* For Vim version 7.3.
es_es: *usr_90.esx* Para Vim versión 7.3.

source: Last change: 2008 Sep 10
es_es: Último cambio: 10/09/2008

source: *install* Before you can use Vim you have to install it.
es_es: *instalar* *install* Antes de usar Vim, tiene que instalarlo.

source: Depending on your system it's simple or easy.
es_es: Es sencillo o fácil dependiendo de su sistema.

source: This chapter gives a few hints and also explains how upgrading to a new version is done.
es_es: Este capítulo ofrece algunas indicaciones y explica cómo se actualiza a una nueva versión.

source: First you have to decide if you are going to install Vim system-wide or for a single user.
es_es: Primero debe decidir si va a instalar Vim para uno o todos los usuarios.

source: The installation is almost the same, but the directory where Vim is installed in differs.
es_es: La instalación es muy similar, pero difiere el directorio de instalación de Vim.

source: For a system-wide installation the base directory "/usr/local" is often used.
es_es: Para una instalación de sistema (todos los usuarios), a menudo se usa el directorio base «/usr/local».

source: But this may be different for your system.
es_es: Pero puede ser distinto en su sistema.

source: Try finding out where other packages are installed.
es_es: Intente averiguar dónde se instalan los otros paquetes.

source: When installing for a single user, you can use your home directory as the base.
es_es: Cuando realiza una instalación para un sólo usuario, puede usar su directorio personal como base.

source: The files will be placed in subdirectories like "bin" and "shared/vim".
es_es: Los ficheros se ubicarań en subdirectorios como «bin» y «shared/vim».

source: You can get precompiled binaries for many different UNIX systems.
es_es: Puede obtener binarios precompilados para muchos sistemas UNIX diferentes.

source: There is a long list with links on this page:
es_es: En esta página hay una larga lista con enlaces:

source: Volunteers maintain the binaries, so they are often out of date.
es_es: Los responsables de los binarios son voluntarios, por lo que a menudo están obsoletos.

source: It is a good idea to compile your own UNIX version from the source.
es_es: Es una buena idea compilar su propia versión UNIX desde las fuentes.

source: Also, creating the editor from the source allows you to control which features are compiled.
es_es: Así mismo, crear el editor desde las fuentes le permite controlar las características a compilar.

source: This does require a compiler though.
es_es: Por otra parte, esto requiere un compilador.

source: If you have a Linux distribution, the "vi" program is probably a minimal version of Vim.
es_es: Si tiene una distribución de Linux, el programa vi es probablemente una versión mínima de Vim.

source: It doesn't do syntax highlighting, for example.
es_es: No ejecuta el resaltado de sintaxis, por ejemplo.

source: Try finding another Vim package in your distribution, or search on the web site.
es_es: Intente buscar otro paquete de Vim en su distribución, o busque en la página web.

source: Go to the "unix" directory and you'll find a list of files there.
es_es: Vaya al directorio «unix», y encontrará una serie de archivos.

source: The version number is embedded in the file name.
es_es: El número de versión está integrado en el nombre del archivo.

source: You can get the files for Unix in two ways: One big archive that contains everything, or four smaller ones that each fit on a floppy disk.
es_es: Puede obtener los archivos para Unix de dos formas: Un único archivo grande que contiene todo, o cuatro más pequeños que caben en un disquete.

source: For version 6.1 the single big one is called:
es_es: El archivo de la versión 6.1 se llama:

source: You need the bzip2 program to uncompress it.
es_es: Necesita el programa bzip2 para descomprimirlo.

source: If you don't have it, get the four smaller files, which can be uncompressed with gzip.
es_es: Si no lo tiene, descargue los cuatro archivos más pequeños, que se pueden descomprimir con gzip.

source: For Vim 6.1 they are called:
es_es: Para Vim 6.1, se llaman:

source: Then unpack the archives there.
es_es: Descomprima los archivos en esa ubicación.

source: If you have the one big archive, you unpack it like this: >
es_es: Si tiene el archivo único grande, lo puede desempaquetar de la siguiente forma: >

source: The make program will run configure and compile everything.
es_es: El programa «make» ejecutará «configure» y compilará todo.

source: Further on we will explain how to compile with different features.
es_es: Más adelante explicaremos como compilar con diferentes funcionalidades.

source: If there are errors while compiling, carefully look at the error messages.
es_es: Si detecta errores durante la compilación, mire con detenimiento los mensajes de error.

source: There should be a hint about what went wrong.
es_es: Debería haber una indicación de qué falló.

source: Hopefully you will be able to correct it.
es_es: Con suerte, podrá corregirlos.

source: You might have to disable some features to make Vim compile.
es_es: Puede que tenga que desactivar algunas funcionalidades para poder compilar Vim.

source: Look in the Makefile for specific hints for your system.
es_es: Consulte el archivo «Makefile» para ver indicaciones específicas a su sistema.

source: This will run a sequence of test scripts to verify that Vim works as expected.
es_es: Esto ejecutará una secuencia de scripts de prueba para comprobar que Vim funciona de la manera esperada.

source: Vim will be started many times and all kinds of text and messages flash by.
es_es: Se iniciará Vim varias veces, y aparecerán rápidamente todo tipo de texto y mensajes.

source: If it is alright you will finally see:
es_es: Si todo es correcto, verá:

source: If you get "TEST FAILURE" some test failed.
es_es: Si le devuelve «TEST FAILURE», es que ha fallado alguna prueba.

source: If there are one or two messages about failed tests, Vim might still work, but not perfectly.
es_es: Si existen uno o más mensajes de pruebas fallidas, puede que Vim funcione, pero no a la perfección.

source: If you see a lot of error messages or Vim doesn't finish until the end, there must be something wrong.
es_es: Si ve muchos mensajes de error o Vim no continua hasta el final, puede que exista algún problema.

source: Either try to find out yourself, or find someone who can solve it.
es_es: Puede intentar encontrarlo manualmente, o encontrar a alguien que lo puede solucionar.

source: You could look in the |maillist-archive| for a solution.
es_es: También puede consultar la lista de correo (|maillist-archive|) en busca de una solución.

source: If everything else fails, you could ask in the vim |maillist| if someone can help you.
es_es: Si todo falla, puede preguntar en la lista de correo (|maillist|) de Vim si alguien le puede ayudar.

source: Remove the # at the start of the line.
es_es: Elimine «#» al principio de la línea.

source: When installing for the whole system, Vim has most likely already selected a good installation directory for you.
es_es: Al instalar para todo el sistema, los más probable es que Vim haya seleccionado un directorio de instalación adecuado.

source: You can also specify one, see below.
es_es: También puede definir uno; vea a continuación.

source: You need to become root for the following.
es_es: Necesita ser el administrador para poder realizar lo siguiente.

source: That should move all the relevant files to the right place.
es_es: Esto debería mover todos los archivos relevantes al sitio adecuado.

source: Now you can try running vim to verify that it works.
es_es: Ahora puede intentar ejecutar Vim para comprobar que funciona.

source: Use two simple tests to check if Vim can find its runtime files: >
es_es: Use dos pruebas sencillas para comprobar que Vim puede encontrar sus archivos de tiempo de ejecución.

source: Don't forget that the user manual assumes you Vim in a certain way.
es_es: No olvide que el manual del usuario supone que usa Vim de una cierta manera.

source: After installing Vim, follow the instructions at |not-compatible| to make Vim work as assumed in this manual.
es_es: Tras instalar Vim, siga las instrucciones en |not-compatible| para que Vim funcione de la forma aceptada en este manual.

source: Vim has many ways to select features.
es_es: Vim ofrece varias formas de seleccionar funcionalidades.

source: One of the simple ways is to edit the Makefile.
es_es: Una de las más sencillas es editar el archivo «Makefile».

source: There are many directions and examples.
es_es: Hay muchas indicaciones y ejemplos.

source: Often you can enable or disable a feature by uncommenting a line.
es_es: Generalmente, puede activar o desactivar una funcionalidad simplemente descomentando una línea.

source: An alternative is to run "configure" separately.
es_es: Otra alternativa es ejecutar «configure» de forma separada.

source: This allows you to specify configuration options manually.
es_es: Le permite especificar opciones de configuración manualmente.

source: The disadvantage is that you have to figure out what exactly to type.
es_es: La desventaja es que tiene que averiguar qué teclear exactamente.

source: Some of the most interesting configure arguments follow.
es_es: A continuación tiene algunas de los argumentos más interesantes.

source: These can also be enabled from the Makefile.
es_es: También se pueden activar desde el archivo «Makefile».

source: --with-features=tiny Compile with many features disabled.
es_es: --with-features=tiny Compilación con varias funcionalidades desactivadas.

source: --with-features=small Compile with some features disabled.
es_es: --with-features=small Compilación con algunas funcionalidades desactivadas.

source: --with-features=big Compile with more features enabled.
es_es: --with-features=big Compilación con más funcionalidades activadas.

source: --with-features=huge Compile with most features enabled.
es_es: --with-features=huge Compilación con la mayoría de funcionalidades activadas.

source: See |+feature-list| for which feature is enabled in which case.
es_es: Consulte |+feature-list| para ver qué funcionalidad está activa por omisión.

source: --enable-perlinterp Enable the Perl interface.
es_es: --enable-perlinterp Activa la interfaz de Perl.

source: There are similar arguments for ruby, python and tcl.
es_es: Existen argumentos similares para Ruby, Python y tcl.

source: --disable-gui Do not compile the GUI interface.
es_es: --disable-gui No compila la interfaz gráfica.

source: --without-x Do not compile X-windows features.
es_es: --without-x No compila las funcionalidades del sistema de ventanas X.

source: When both of these are used, Vim will not connect to the X server, which makes startup faster.
es_es: Si se usan las dos, Vim no se conectará al servidor de X, lo cual agiliza el inicio.

source: You can find a bit of explanation for each feature, and links for more information here: |feature-list|.
es_es: Puede encontrar una explicación de cada funcionalidad y enlaces a más información aquí: |feature-list|.
